#-----------------------------------------------#
# Written by Mrinal Haloi, NTU Singapore
# Implementation of Google original paper "Rethinking the Inception Architecture for Computer Vision"
# http://arxiv.org/abs/1512.00567
#-----------------------------------------------#

name: "GoogleNet_Inception_v3"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    crop_size: 224
    mean_file: "path/to/mean.binaryproto"
  }
  data_param {
    source: "path/to/train_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    crop_size: 224
    mean_file: "path/to/mean.binaryproto"
  }
  data_param {
    source: "/path/to/val_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "conv1/3x3_s2"
  type: "Convolution"
  bottom: "data"
  top: "conv1/3x3_s2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
   name: "bn1"
   type: "BatchNorm"
   bottom: "conv1/3x3_s2"
   top: "bn1"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}

layer {
   name: "bn1"
   type: "BatchNorm"
   bottom: "conv1/3x3_s2"
   top: "bn1"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "conv1/3x3_s1_scale"
  type: "Scale"
  bottom: "bn1"
  top: "bn1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}

layer {
  bottom: "bn1"
  top: "bn1"
  name: "prelu1_11"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "conv2/3x3_s1"
  type: "Convolution"
  bottom: "bn1"
  top: "conv2/3x3_s1"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 1
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}

layer {
   name: "bn2"
   type: "BatchNorm"
   bottom: "conv2/3x3_s1"
   top: "bn2"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn2"
   type: "BatchNorm"
   bottom: "conv2/3x3_s1"
   top: "bn2"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "conv2/3x3_s1_scale"
  type: "Scale"
  bottom: "bn2"
  top: "bn2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn2"
  top: "bn2"
  name: "prelu1_2"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "conv3/3x3_s1"
  type: "Convolution"
  bottom: "bn2"
  top: "conv3/3x3_s1"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 1
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}

layer {
   name: "bn3"
   type: "BatchNorm"
   bottom: "conv3/3x3_s1"
   top: "bn3"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn3"
   type: "BatchNorm"
   bottom: "conv3/3x3_s1"
   top: "bn3"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "conv3/3x3_s1_scale"
  type: "Scale"
  bottom: "bn3"
  top: "bn3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn3"
  top: "bn3"
  name: "prelu1_3"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "pool1/3x3_s2"
  type: "Pooling"
  bottom: "bn3"
  top: "pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    pad: 1
    stride: 2
  }
}

layer {
  name: "conv4/3x3_s1"
  type: "Convolution"
  bottom: "pool1/3x3_s2"
  top: "conv4/3x3_s1"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 1
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}

layer {
   name: "bn4"
   type: "BatchNorm"
   bottom: "conv4/3x3_s1"
   top: "bn4"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn4"
   type: "BatchNorm"
   bottom: "conv4/3x3_s1"
   top: "bn4"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "conv4/3x3_s1_scale"
  type: "Scale"
  bottom: "bn4"
  top: "bn4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn4"
  top: "bn4"
  name: "prelu1_4"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "conv5/3x3_s2"
  type: "Convolution"
  bottom: "bn4"
  top: "conv5/3x3_s2"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 2
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}

layer {
   name: "bn5"
   type: "BatchNorm"
   bottom: "conv5/3x3_s2"
   top: "bn5"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn5"
   type: "BatchNorm"
   bottom: "conv5/3x3_s2"
   top: "bn5"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "conv5/3x3_s2_scale"
  type: "Scale"
  bottom: "bn5"
  top: "bn5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn5"
  top: "bn5"
  name: "prelu1_5"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "conv6/3x3_s1"
  type: "Convolution"
  bottom: "bn5"
  top: "conv6/3x3_s1"
  param {
     lr_mult: 1
     decay_mult: 1
  }
  param {
     lr_mult: 2
     decay_mult: 0
  }
  convolution_param {
     num_output: 32
     pad: 1
     kernel_size: 3
     stride: 2
     weight_filler{
       type: "msra"
    }
    bias_filler {
       type: "constant"
       value: 0.2
    }
  }
}

layer {
   name: "bn6"
   type: "BatchNorm"
   bottom: "conv6/3x3_s1"
   top: "bn6"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn6"
   type: "BatchNorm"
   bottom: "conv6/3x3_s1"
   top: "bn6"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "conv6/3x3_s1_scale"
  type: "Scale"
  bottom: "bn6"
  top: "bn6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn6"
  top: "bn6"
  name: "prelu1_6"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

#--------------------------------#
##Start of inception_v3 block 1##
#--------------------------------#

layer {
  name: "inception_3a/1x1"
  type: "Convolution"
  bottom: "bn6"
  top: "inception_3a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3a/1x1"
   type: "BatchNorm"
   bottom: "inception_3a/1x1"
   top: "bn_inception_3a/1x1"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3a/1x1"
   type: "BatchNorm"
   bottom: "inception_3a/1x1"
   top: "bn_inception_3a/1x1"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3a_scale"
  type: "Scale"
  bottom: "bn_inception_3a/1x1"
  top: "bn_inception_3a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3a/1x1"
  top: "bn_inception_3a/1x1"
  name: "prelu1_bn_inception_3a"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "bn6"
  top: "inception_3a/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3a_3x3reduce"
   type: "BatchNorm"
   bottom: "inception_3a/3x3_reduce"
   top: "bn_inception_3a_3x3reduce"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3a_3x3reduce"
   type: "BatchNorm"
   bottom: "inception_3a/3x3_reduce"
   top: "bn_inception_3a_3x3reduce"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3a_3x3reduce_scale"
  type: "Scale"
  bottom: "bn_inception_3a_3x3reduce"
  top: "bn_inception_3a_3x3reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3a_3x3reduce"
  top: "bn_inception_3a_3x3reduce"
  name: "prelu1_bn_inception_3a_3x3reduce"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3a/3x3"
  type: "Convolution"
  bottom: "bn_inception_3a_3x3reduce"
  top: "inception_3a/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3a/3x3"
   type: "BatchNorm"
   bottom: "inception_3a/3x3"
   top: "bn_inception_3a/3x3"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3a/3x3"
   type: "BatchNorm"
   bottom: "inception_3a/3x3"
   top: "bn_inception_3a/3x3"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3a/3x3_scale"
  type: "Scale"
  bottom: "bn_inception_3a/3x3"
  top: "bn_inception_3a/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3a/3x3"
  top: "bn_inception_3a/3x3"
  name: "prelu1_bn_inception_3a/3x3"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3a/3x3x2_reduce"
  type: "Convolution"
  bottom: "bn6"
  top: "inception_3a/3x3x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3a/3x3x2"
   type: "BatchNorm"
   bottom: "inception_3a/3x3x2_reduce"
   top: "bn_inception_3a/3x3x2"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3a/3x3x2"
   type: "BatchNorm"
   bottom: "inception_3a/3x3x2_reduce"
   top: "bn_inception_3a/3x3x2"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3a/3x3x2_scale"
  type: "Scale"
  bottom: "bn_inception_3a/3x3x2"
  top: "bn_inception_3a/3x3x2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3a/3x3x2"
  top: "bn_inception_3a/3x3x2"
  name: "prelu1_bn_inception_3a/3x3x2"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3a/3x3x2_1"
  type: "Convolution"
  bottom: "bn_inception_3a/3x3x2"
  top: "inception_3a/3x3x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3a/3x3x2_1"
   type: "BatchNorm"
   bottom: "inception_3a/3x3x2_1"
   top: "bn_inception_3a/3x3x2_1"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3a/3x3x2_1"
   type: "BatchNorm"
   bottom: "inception_3a/3x3x2_1"
   top: "bn_inception_3a/3x3x2_1"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3a/3x3x2_1_scale"
  type: "Scale"
  bottom: "bn_inception_3a/3x3x2_1"
  top: "bn_inception_3a/3x3x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3a/3x3x2_1"
  top: "bn_inception_3a/3x3x2_1"
  name: "prelu1_bn_inception_3a/3x3x2_1"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3a/3x3x2_2"
  type: "Convolution"
  bottom: "bn_inception_3a/3x3x2_1"
  top: "inception_3a/3x3x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3a/3x3x2_2"
   type: "BatchNorm"
   bottom: "inception_3a/3x3x2_2"
   top: "bn_inception_3a/3x3x2_2"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3a/3x3x2_2"
   type: "BatchNorm"
   bottom: "inception_3a/3x3x2_2"
   top: "bn_inception_3a/3x3x2_2"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3a/3x3x2_2_scale"
  type: "Scale"
  bottom: "bn_inception_3a/3x3x2_2"
  top: "bn_inception_3a/3x3x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3a/3x3x2_2"
  top: "bn_inception_3a/3x3x2_2"
  name: "prelu1_bn_inception_3a/3x3x2_2"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}


layer {
  name: "inception_3a/pool"
  type: "Pooling"
  bottom: "bn6"
  top: "inception_3a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj"
  type: "Convolution"
  bottom: "inception_3a/pool"
  top: "inception_3a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3a/pool_proj"
   type: "BatchNorm"
   bottom: "inception_3a/pool_proj"
   top: "bn_inception_3a/pool_proj"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3a/pool_proj"
   type: "BatchNorm"
   bottom: "inception_3a/pool_proj"
   top: "bn_inception_3a/pool_proj"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3a/pool_proj_scale"
  type: "Scale"
  bottom: "bn_inception_3a/pool_proj"
  top: "bn_inception_3a/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3a/pool_proj"
  top: "bn_inception_3a/pool_proj"
  name: "prelu1_bn_inception_3a/pool"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3a/output"
  type: "Concat"
  bottom: "bn_inception_3a/1x1"
  bottom: "bn_inception_3a/3x3"
  bottom: "bn_inception_3a/3x3x2_2"
  bottom: "bn_inception_3a/pool_proj"
  top: "inception_3a/output"
}

# End of first inception_v3 block a #
#-----------------------------------#


# Start of inception_v3 block b #

layer {
  name: "inception_3b/1x1"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3b/1x1"
   type: "BatchNorm"
   bottom: "inception_3b/1x1"
   top: "bn_inception_3b/1x1"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3b/1x1"
   type: "BatchNorm"
   bottom: "inception_3b/1x1"
   top: "bn_inception_3b/1x1"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3b/1x1_scale"
  type: "Scale"
  bottom: "bn_inception_3b/1x1"
  top: "bn_inception_3b/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3b/1x1"
  top: "bn_inception_3b/1x1"
  name: "prelu1_bn_inception_3b"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3b_3x3reduce"
   type: "BatchNorm"
   bottom: "inception_3b/3x3_reduce"
   top: "bn_inception_3b_3x3reduce"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3b_3x3reduce"
   type: "BatchNorm"
   bottom: "inception_3b/3x3_reduce"
   top: "bn_inception_3b_3x3reduce"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3b_3x3reduce_scale"
  type: "Scale"
  bottom: "bn_inception_3b_3x3reduce"
  top: "bn_inception_3b_3x3reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3b_3x3reduce"
  top: "bn_inception_3b_3x3reduce"
  name: "prelu1_bn_inception_3b_3x3reduce"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3b/3x3"
  type: "Convolution"
  bottom: "bn_inception_3b_3x3reduce"
  top: "inception_3b/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3b/3x3"
   type: "BatchNorm"
   bottom: "inception_3b/3x3"
   top: "bn_inception_3b/3x3"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3b/3x3"
   type: "BatchNorm"
   bottom: "inception_3b/3x3"
   top: "bn_inception_3b/3x3"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3b/3x3_scale"
  type: "Scale"
  bottom: "bn_inception_3b/3x3"
  top: "bn_inception_3b/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3b/3x3"
  top: "bn_inception_3b/3x3"
  name: "prelu1_bn_inception_3b/3x3"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3b/3x3x2_reduce"
  type: "Convolution"
  bottom: "inception_3a/output"
  top: "inception_3b/3x3x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3b/3x3x2"
   type: "BatchNorm"
   bottom: "inception_3b/3x3x2_reduce"
   top: "bn_inception_3b/3x3x2"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3b/3x3x2"
   type: "BatchNorm"
   bottom: "inception_3b/3x3x2_reduce"
   top: "bn_inception_3b/3x3x2"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3b/3x3x2_scale"
  type: "Scale"
  bottom: "bn_inception_3b/3x3x2"
  top: "bn_inception_3b/3x3x2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3b/3x3x2"
  top: "bn_inception_3b/3x3x2"
  name: "prelu1_bn_inception_3b/3x3x2"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3b/3x3x2_1"
  type: "Convolution"
  bottom: "bn_inception_3b/3x3x2"
  top: "inception_3b/3x3x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3b/3x3x2_1"
   type: "BatchNorm"
   bottom: "inception_3b/3x3x2_1"
   top: "bn_inception_3b/3x3x2_1"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3b/3x3x2_1"
   type: "BatchNorm"
   bottom: "inception_3b/3x3x2_1"
   top: "bn_inception_3b/3x3x2_1"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3b/3x3x2_1_scale"
  type: "Scale"
  bottom: "bn_inception_3b/3x3x2_1"
  top: "bn_inception_3b/3x3x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3b/3x3x2_1"
  top: "bn_inception_3b/3x3x2_1"
  name: "prelu1_bn_inception_3b/3x3x2_1"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3b/3x3x2_2"
  type: "Convolution"
  bottom: "bn_inception_3b/3x3x2_1"
  top: "inception_3b/3x3x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3b/3x3x2_2"
   type: "BatchNorm"
   bottom: "inception_3b/3x3x2_2"
   top: "bn_inception_3b/3x3x2_2"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3b/3x3x2_2"
   type: "BatchNorm"
   bottom: "inception_3b/3x3x2_2"
   top: "bn_inception_3b/3x3x2_2"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3b/3x3x2_2_scale"
  type: "Scale"
  bottom: "bn_inception_3b/3x3x2_2"
  top: "bn_inception_3b/3x3x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3b/3x3x2_2"
  top: "bn_inception_3b/3x3x2_2"
  name: "prelu1_bn_inception_3b/3x3x2_2"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}


layer {
  name: "inception_3b/pool"
  type: "Pooling"
  bottom: "inception_3a/output"
  top: "inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3b/pool_proj"
  type: "Convolution"
  bottom: "inception_3b/pool"
  top: "inception_3b/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3b/pool_proj"
   type: "BatchNorm"
   bottom: "inception_3b/pool_proj"
   top: "bn_inception_3b/pool_proj"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3b/pool_proj"
   type: "BatchNorm"
   bottom: "inception_3b/pool_proj"
   top: "bn_inception_3b/pool_proj"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3b/pool_proj_scale"
  type: "Scale"
  bottom: "bn_inception_3b/pool_proj"
  top: "bn_inception_3b/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3b/pool_proj"
  top: "bn_inception_3b/pool_proj"
  name: "prelu1_bn_inception_3b/pool"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3b/output"
  type: "Concat"
  bottom: "bn_inception_3b/1x1"
  bottom: "bn_inception_3b/3x3"
  bottom: "bn_inception_3b/3x3x2_2"
  bottom: "bn_inception_3b/pool_proj"
  top: "inception_3b/output"
}

# End of inception_v3 block b #
#----------------------------#

# Start of inception_v3 block c#

layer {
  name: "inception_3c/1x1"
  type: "Convolution"
  bottom: "inception_3b/output"
  top: "inception_3c/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3c/1x1"
   type: "BatchNorm"
   bottom: "inception_3c/1x1"
   top: "bn_inception_3c/1x1"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3c/1x1"
   type: "BatchNorm"
   bottom: "inception_3c/1x1"
   top: "bn_inception_3c/1x1"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3c/1x1_scale"
  type: "Scale"
  bottom: "bn_inception_3c/1x1"
  top: "bn_inception_3c/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3c/1x1"
  top: "bn_inception_3c/1x1"
  name: "prelu1_bn_inception_3c"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3c/3x3_reduce"
  type: "Convolution"
  bottom: "inception_3b/output"
  top: "inception_3c/3x3_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3c_3x3reduce"
   type: "BatchNorm"
   bottom: "inception_3c/3x3_reduce"
   top: "bn_inception_3c_3x3reduce"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3c_3x3reduce"
   type: "BatchNorm"
   bottom: "inception_3c/3x3_reduce"
   top: "bn_inception_3c_3x3reduce"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3c_3x3reduce_scale"
  type: "Scale"
  bottom: "bn_inception_3c_3x3reduce"
  top: "bn_inception_3c_3x3reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3c_3x3reduce"
  top: "bn_inception_3c_3x3reduce"
  name: "prelu1_bn_inception_3c_3x3reduce"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3c/3x3"
  type: "Convolution"
  bottom: "bn_inception_3c_3x3reduce"
  top: "inception_3c/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3c/3x3"
   type: "BatchNorm"
   bottom: "inception_3c/3x3"
   top: "bn_inception_3c/3x3"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3c/3x3"
   type: "BatchNorm"
   bottom: "inception_3c/3x3"
   top: "bn_inception_3c/3x3"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3c/3x3_scale"
  type: "Scale"
  bottom: "bn_inception_3c/3x3"
  top: "bn_inception_3c/3x3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3c/3x3"
  top: "bn_inception_3c/3x3"
  name: "prelu1_bn_inception_3c/3x3"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3c/3x3x2_reduce"
  type: "Convolution"
  bottom: "inception_3b/output"
  top: "inception_3c/3x3x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3c/3x3x2"
   type: "BatchNorm"
   bottom: "inception_3c/3x3x2_reduce"
   top: "bn_inception_3c/3x3x2"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3c/3x3x2"
   type: "BatchNorm"
   bottom: "inception_3c/3x3x2_reduce"
   top: "bn_inception_3c/3x3x2"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3c/3x3x2_scale"
  type: "Scale"
  bottom: "bn_inception_3c/3x3x2"
  top: "bn_inception_3c/3x3x2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3c/3x3x2"
  top: "bn_inception_3c/3x3x2"
  name: "prelu1_bn_inception_3c/3x3x2"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3c/3x3x2_1"
  type: "Convolution"
  bottom: "bn_inception_3c/3x3x2"
  top: "inception_3c/3x3x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3c/3x3x2_1"
   type: "BatchNorm"
   bottom: "inception_3c/3x3x2_1"
   top: "bn_inception_3c/3x3x2_1"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3c/3x3x2_1"
   type: "BatchNorm"
   bottom: "inception_3c/3x3x2_1"
   top: "bn_inception_3c/3x3x2_1"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3c/3x3x2_1_scale"
  type: "Scale"
  bottom: "bn_inception_3c/3x3x2_1"
  top: "bn_inception_3c/3x3x2_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3c/3x3x2_1"
  top: "bn_inception_3c/3x3x2_1"
  name: "prelu1_bn_inception_3c/3x3x2_1"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}

layer {
  name: "inception_3c/3x3x2_2"
  type: "Convolution"
  bottom: "bn_inception_3c/3x3x2_1"
  top: "inception_3c/3x3x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3c/3x3x2_2"
   type: "BatchNorm"
   bottom: "inception_3c/3x3x2_2"
   top: "bn_inception_3c/3x3x2_2"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3c/3x3x2_2"
   type: "BatchNorm"
   bottom: "inception_3c/3x3x2_2"
   top: "bn_inception_3c/3x3x2_2"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3c/3x3x2_2_scale"
  type: "Scale"
  bottom: "bn_inception_3c/3x3x2_2"
  top: "bn_inception_3c/3x3x2_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3c/3x3x2_2"
  top: "bn_inception_3c/3x3x2_2"
  name: "prelu1_bn_inception_3c/3x3x2_2"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}


layer {
  name: "inception_3c/pool"
  type: "Pooling"
  bottom: "inception_3b/output"
  top: "inception_3c/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3c/pool_proj"
  type: "Convolution"
  bottom: "inception_3c/pool"
  top: "inception_3c/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_3c/pool_proj"
   type: "BatchNorm"
   bottom: "inception_3c/pool_proj"
   top: "bn_inception_3c/pool_proj"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_3c/pool_proj"
   type: "BatchNorm"
   bottom: "inception_3c/pool_proj"
   top: "bn_inception_3c/pool_proj"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_3c/pool_proj_scale"
  type: "Scale"
  bottom: "bn_inception_3c/pool_proj"
  top: "bn_inception_3c/pool_proj"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_3c/pool_proj"
  top: "bn_inception_3c/pool_proj"
  name: "prelu1_bn_inception_3c/pool"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}
layer {
  name: "inception_3c/output"
  type: "Concat"
  bottom: "bn_inception_3c/1x1"
  bottom: "bn_inception_3c/3x3"
  bottom: "bn_inception_3c/3x3x2_2"
  bottom: "bn_inception_3c/pool_proj"
  top: "inception_3c/output"
}

# End of inception_v3 block b #
#----------------------------#



layer {
  name: "inception_3_end/output"
  type: "Pooling"
  bottom: "inception_3c/output"
  top: "inception_3_end/output"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 1
  }
}

# Start of Inception_v3 modelb #
#------------------------------#

layer {
  name: "inception_4a/1x1"
  type: "Convolution"
  bottom: "inception_3_end/output"
  top: "inception_4a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_4a/1x1"
   type: "BatchNorm"
   bottom: "inception_4a/1x1"
   top: "bn_inception_4a/1x1"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_4a/1x1"
   type: "BatchNorm"
   bottom: "inception_4a/1x1"
   top: "bn_inception_4a/1x1"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_4a/1x1_scale"
  type: "Scale"
  bottom: "bn_inception_4a/1x1"
  top: "bn_inception_4a/1x1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
    decay_mult: 0
  }
  scale_param {
    axis: 1
    num_axes: 1
    filler {
      type: "constant"
      value: 1.0000001
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
    bias_term: true
  }
}
layer {
  bottom: "bn_inception_4a/1x1"
  top: "bn_inception_4a/1x1"
  name: "prelu1_bn_inception_4a"
  type: "PReLU"
  param {
      lr_mult: 0
  }
  prelu_param: {
     filler { value: 0.1 type: "constant" }
  }
}



layer {
  name: "inception_4a/1x7x2_reduce"
  type: "Convolution"
  bottom: "inception_3_end/output"
  top: "inception_4a/1x7x2_reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "msra"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}

layer {
   name: "bn_inception_4a_1x7x2reduce"
   type: "BatchNorm"
   bottom: "inception_4a/1x7x2_reduce"
   top: "bn_inception_4a_1x7x2reduce"
   batch_norm_param {
     use_global_stats: false
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TRAIN
  }
}
layer {
   name: "bn_inception_4a_1x7x2reduce"
   type: "BatchNorm"
   bottom: "inception_4a/1x7x2_reduce"
   top: "bn_inception_4a_1x7x2reduce"
   batch_norm_param {
     use_global_stats: true
  }
    param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   param {
     lr_mult: 0
  }
   include {
    phase: TEST
  }
}
layer {
  name: "bn_inception_4a_1x7x2reduce_scale"
  type: "Scale"
  bottom: "bn_inception_4a_1x7x2reduce"
  top: "bn_inception_4a_1x7x2reduce"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 1
